In [6]:
from pandas import DataFrame
df = DataFrame(
              [
                  [19,14,18,19],
                  [18,10,17,16],
                  [17,16,18,15]
              ]
            ,columns=['OSA','JAVA','SE','DS']
              )
df

   OSA  JAVA  SE  DS
0   19    14  18  19
1   18    10  17  16
2   17    16  18  15

In [7]:
df.sum()

OSA     54
JAVA    40
SE      53
DS      50
dtype: int64

In [8]:
df.max()

OSA     19
JAVA    16
SE      18
DS      19
dtype: int64

In [9]:
df.min()

OSA     17
JAVA    10
SE      17
DS      15
dtype: int64

In [10]:
df.mean()

OSA     18.000000
JAVA    13.333333
SE      17.666667
DS      16.666667
dtype: float64

In [11]:
df.count()

OSA     3
JAVA    3
SE      3
DS      3
dtype: int64

In [12]:
df.median()

OSA     18.0
JAVA    14.0
SE      18.0
DS      16.0
dtype: float64

In [16]:
df.describe()

        OSA       JAVA         SE         DS
count   3.0   3.000000   3.000000   3.000000
mean   18.0  13.333333  17.666667  16.666667
std     1.0   3.055050   0.577350   2.081666
min    17.0  10.000000  17.000000  15.000000
25%    17.5  12.000000  17.500000  15.500000
50%    18.0  14.000000  18.000000  16.000000
75%    18.5  15.000000  18.000000  17.500000
max    19.0  16.000000  18.000000  19.000000

In [17]:
df.agg(['sum','min','max'])

     OSA  JAVA  SE  DS
sum   54    40  53  50
min   17    10  17  15
max   19    16  18  19

# GROUPING FUNCTION

In [19]:
from pandas import DataFrame
df1 = DataFrame(
               [
                ['Aryan','Singh','Full-time','Administration',2,20000],
                ['Rohan','Agarwal','Intern','Technical',3,5000],
                   ['Riya','Shah','Full-time','Administration',5,100000],
                   ['Yash','Bhatia','Part-time','Technical',7,100000],
                   ['Siddhant','Khanna','Full-time','Management',6,200000]
               ]
               ,columns=['First Name','last Name','Type','Department','YoE','Salary']
              )
df1

  First Name last Name       Type      Department  YoE  Salary
0      Aryan     Singh  Full-time  Administration    2   20000
1      Rohan   Agarwal     Intern       Technical    3    5000
2       Riya      Shah  Full-time  Administration    5  100000
3       Yash    Bhatia  Part-time       Technical    7  100000
4   Siddhant    Khanna  Full-time      Management    6  200000

In [23]:
df1.groupby(['Type']).sum()

           YoE  Salary
Type
Full-time   13  320000
Intern       3    5000
Part-time    7  100000

In [25]:
df1.groupby(['Type']).mean()

                YoE         Salary
Type
Full-time  4.333333  106666.666667
Intern     3.000000    5000.000000
Part-time  7.000000  100000.000000

In [26]:
df1.groupby(['Type','Department']).sum()

                          YoE  Salary
Type      Department
Full-time Administration    7  120000
          Management        6  200000
Intern    Technical         3    5000
Part-time Technical         7  100000

In [27]:
df1.groupby(['Type','Department']).mean()

                          YoE    Salary
Type      Department
Full-time Administration  3.5   60000.0
          Management      6.0  200000.0
Intern    Technical       3.0    5000.0
Part-time Technical       7.0  100000.0

In [30]:
df1.groupby(['Department','Type']).sum()

                          YoE  Salary
Department     Type
Administration Full-time    7  120000
Management     Full-time    6  200000
Technical      Intern       3    5000
               Part-time    7  100000